Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: ཡོན་ཏན་དེ་དག་འཐོབ་ཏུ་ཉེ་བ་ཞིག་ཡིན་ན་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: If such bodhisattvas are close to attaining these qualities, consider them to be on one of the first seven bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཅང་མི་གསུང་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་ཆོས་ལ་སྒྲིབ་པར་འགྱུར་བའི་ལས་བསགས་པ་ཡིན་པས།
en: 2. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata remaining silent, those bodhisattvas have accumulated karma that obscures the Dharma.

source: དེས་ཆོས་མཉན་པ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱ་ཞིང་ཁ་ཏོན་ལ་ཡང་དག་པར་བརྩོན་པའི་གང་ཟག་རྣམས་ལ་ཡང་བདེ་བའི་བསྙེན་བཀུར་དག་ཉེ་བར་བསྒྲུབ་པར་བྱའོ། །
en: That being the case, they should inspire themselves to listen to the Dharma and should render joyful service to people dedicated to reciting the Dharma.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ།
en: By doing so, those bodhisattvas’ related karmic obscurations will be purified.

source: གང་ཟག་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: Consider such individuals to be on one of the first seven bhūmis.

source: དེའི་ཚེ་དེ་ས་དང་པོ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་སྦྱང་བའི་ཕྱིར་ལོ་བདུན་ཏུ་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་གདོན་པར་བྱའོ། །
en: “If at that time those individuals are on the first bhūmi, they should recite Three Sections Dharma discourse three times a day and three times a night for seven years as an act of purification.

source: ཇི་སྟེ་ས་གཉིས་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་དྲུག་ཏུ་གདོན་པར་བྱའོ། །
en: If they are on the second bhūmi, they should recite it for six years.

source: ཇི་སྟེ་ས་གསུམ་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་ལྔར་གདོན་པར་བྱའོ། །
en: If on the third bhūmi, they should recite it for five years.

source: ཇི་སྟེ་ས་བཞི་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་བཞིར་གདོན་པར་བྱའོ། །
en: If on the fourth bhūmi, they should recite it for four years.

source: ཇི་སྟེ་ས་ལྔ་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་གསུམ་དུ་གདོན་པར་བྱའོ། །
en: If on the fifth bhūmi, they should recite it for three years.

source: ཇི་སྟེ་ས་དྲུག་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་གཉིས་སུ་གདོན་པར་བྱའོ། །
en: If on the sixth bhūmi, they should recite it for two years.

source: ཇི་སྟེ་ས་བདུན་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོར་གདོན་པར་བྱའོ། །
en: And if on the seventh bhūmi, they should recite it for one year.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་དབུ་དང་ཞབས་སུ་བཅས་པར་གཡོགས་པ་མཐོང་ན་དེས་ནི་སེམས་ཅན་རྣམས་དགེ་བའི་བཤེས་གཉེན་ལ་ལྟ་བ་དང་།
en: 3. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata covered from head to toe, they have separated beings from seeing their spiritual guides and from hearing the Dharma.

source: ཆོས་ཉན་པ་དང་ཕྲལ་བ་ཡིན་པས་དེས་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་སྤོབས་པར་བྱེད་པའི་དངོས་པོ་ཉེ་བར་བསྒྲུབ་པར་བྱའོ། །
en: This being the case, with a mind free of hostility they should provide beings with the requisites for developing confidence.

source: གང་ཟག་དེ་ནི་ལས་དང་པོ་པར་བལྟའོ། །
en: Consider those individuals to be novices.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཞལ་ཕྱིར་ཕྱོགས་པ་མཐོང་ན་དེས་ནི་རབ་ཏུ་འབྱུང་བའི་བར་ཆད་བྱས་ཤིང་ཆོས་ཉན་པ་རྣམས་ལ་ཡང་སྒྲིབ་པ་བསྐྱེད་པ་ཡིན་པས་དེས་ཆོས་ཀྱི་ཁྲི་སྟན་བཤམ་པའི་ངང་ཚུལ་ཅན་དུ་བྱ། སེམས་ཅན་རྣམས་ཀྱང་ཆོས་ཉན་དུ་གཟུད་པར་བྱའོ། །
en: 4. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata with his face averted, it means they have created hindrances to becoming a renunciant and developed obscurations toward those who study the Dharma. This being the case, such bodhisattvas should maintain the practice of arranging the Dharma throne and encourage beings to listen to the Dharma.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། གང་ཟག་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: By doing so, those bodhisattvas’ related karmic obscurations will be purified. Consider those individuals to be on one of the first seven bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་འཇིམ་པ་ལས་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟ་སྟེ།
en: 5. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata’s form fashioned out of clay, consider them to be on the first bhūmi.

source: དེས་ནི་ཆོས་སྨྲ་བའི་སྤྱོད་པ་ལ་དཔྱས་བྱས་པ་ཡིན་པས་དེས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ནམ།
en: Such bodhisattvas have criticized the conduct of a Dharma teacher and should therefore place a lamp at the top of a tathāgata’s caitya or shrine containing Dharma texts.

source: ཆོས་ཡིག་ཁང་དུ་མགོ་ལ་མར་མེ་གཞག་པར་བྱ་ཞིང་དེས་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱའོ། །
en: This should be done with a mind free of hostility.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: By doing so, those bodhisattvas’ related karmic obscurations will be purified.

source: གལ་ཏེ་ས་གཞན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞིག་གིས་མཚན་མ་དེ་ལྟ་བུ་མཐོང་ན་ནི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །
en: If bodhisattvas residing on one of the other bhūmis see signs of this kind, it should be recognized as the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚོན་གྱིས་བྲིས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པོ་གང་ཡང་རུང་བ་དག་ཏུ་བལྟ་སྟེ།
en: 6. “Vajrapramardin, if in a dream bodhisattvas see the form of the Tathāgata drawn in color, consider them to be on one of the first five bhūmis.

source: སངས་རྒྱས་ཀྱི་སྐུ་བྲིས་པ་ལ་སྤོས་སམ། མེ་ཏོག་དག་གིས་མཆོད་པ་བྱེད་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: If those bodhisattvas perceive themselves making offerings of incense or flowers to the drawn image of the Buddha, consider them to be on the first bhūmi.

source: ཇི་སྟེ་ཐལ་མོ་སྦྱོར་ན་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If their palms are pressed together, consider them to be on the second bhūmi.

source: ཇི་སྟེ་བསྟོད་པ་བྱེད་ན་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they offer praise, consider them to be on the third bhūmi.

source: ཇི་སྟེ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་ན་ནི་ས་བཞི་བར་བལྟའོ། །
en: If they prostrate with their five limbs, consider them to be on the fourth bhūmi.

source: ཇི་སྟེ་སྐོར་བ་བྱེད་ན་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If circumambulating, consider them to be on the fifth bhūmi.

source: དེས་ཆོས་ཟབ་མོ་དག་ལ་བཟོད་པ་བསྐྱེད་པར་བྱ་སྟེ།
en: Such bodhisattvas should generate acceptance of the profound Dharma.

source: དེའི་འོག་ཏུ་ལུང་བསྟན་པ་ཐོབ་པར་ཡང་འགྱུར་རོ། །
en: Once they have done so, they will receive a prediction. 7.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་བཞུད་པ་མཐོང་ན།
en: “Vajrapramardin, if in a dream bodhisattvas see an image of the Tathāgata walking away, it indicates that those bodhisattvas had been contemptuous in their recitation and instruction.

source: དེས་ནི་བརྙས་ཐབས་བྱས་ཤིང་ཁ་ཏོན་དང་ལུང་ཕོག་པ་ཡིན་པས་དེས་བག་ཡོད་པར་བརྩོན་འགྲུས་བརྩམ་པར་བྱ་ཞིང་། ཡང་དང་ཡང་དུ་ཆོས་མཉན་པ་ཡང་སྦྱིན་པར་བྱ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དག་ཀྱང་བྱི་དོར་བྱའོ། །
en: They should therefore make an effort to be conscientious, should continuously create opportunities to listen to the Dharma, and should clean caityas of the tathāgatas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: Consider such bodhisattvas to be on the third bhūmi.

source: ཇི་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་ཞིག་འགྲོ་བ་ན་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་དེ་ལ་མཚན་མ་ཅིར་འགྱུར་ཞེ་ན།
en: “What would it signify if those bodhisattvas saw the Tathāgata when they were walking somewhere else?

source: གལ་ཏེ་བཀད་སར་འགྲོ་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་ས་དང་པོ་པར་བལྟའོ། །
en: If bodhisattvas see the Tathāgata while walking to the dining hall, consider them to be on the first bhūmi.

source: གལ་ཏེ་གཙུག་ལག་ཁང་དུ་འགྲོ་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་ནས་གཉིས་པར་བལྟའོ། །
en: If bodhisattvas see the Tathāgata while walking to the temple, consider them to be on the second bhūmi.

source: གལ་ཏེ་ཆོས་ཉན་དུ་འགྲོ་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་ས་གསུམ་པར་བལྟའོ། །
en: If bodhisattvas see the Tathāgata while on their way to listen to the Dharma, consider them to be on the third bhūmi.

source: གལ་ཏེ་ནང་དུ་ཡང་དག་འཇོག་ནས་བཞི་པར་བལྟའོ། །
en: If in meditative seclusion, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་དབེན་པ་ལ་འདུག་ན་ས་ལྔ་པར་བལྟའོ། །
en: If living in solitude, consider them to be on the fifth bhūmi.

source: གལ་ཏེ་སྨྲ་ཞིང་འགྲོ་ལ་མཐོང་ན་ས་དྲུག་པར་བལྟའོ། །
en: If seen while walking or speaking, consider them to be on the sixth bhūmi.

source: གལ་ཏེ་རབ་ཏུ་འདུད་ཅིང་འགྲོ་ལ་མཐོང་ན་ས་བདུན་པར་བལྟའོ། །
en: If seen while walking and making obeisance, consider them to be on the seventh bhūmi.

source: གལ་ཏེ་ཆོ་འཕྲུལ་བྱེད་ཅིང་འགྲོ་ལ་མཐོང་ན་ས་བརྒྱད་པར་བལྟའོ། །
en: If seen while walking and performing miracles, consider them to be on the eighth bhūmi.

source: གལ་ཏེ་སྤྲུལ་པ་སྤྲུལ་ཞིང་འགྲོ་ནས་དགུ་པར་བལྟའོ། །
en: If while walking and manifesting emanations, consider them to be on the ninth bhūmi.

source: གལ་ཏེ་གཡས་གཡོན་དུ་བལྟ་ཞིང་འགྲོ་ལ་སྨྲ་ཞིང་སྟོང་པ་ཉིད་རྗོད་ན་ས་བཅུ་པར་བལྟའོ། །
en: If talking and speaking of emptiness while walking and looking right and left, consider them to be on the tenth bhūmi. 8.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་ན་ཆོས་སྟོན་པ་མཐོང་ལ་རྣམ་པར་མི་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata teaching the Dharma in the midst of an assembly but do not understand, consider them to be on any of the ten bhūmis.

source: དེས་ནི་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཆོས་སྨྲ་བ་ལ་འདི་ནི་ཤེས་བཞིན་དུ་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་སྨད་པ་ཡིན་པས་དེས་དགེ་བའི་བཤེས་གཉེན་དང་མི་འབྲལ་བར་ཐོས་པ་ཡོངས་སུ་བཙལ་བར་བྱ་ཞིང་དེས་གླགས་ལྟ་བ་མེད་པར་ཡང་བྱའོ། །
en: This sign is the result of disparaging a person who recites the Dharma of the Teacher’s parinirvāṇa by saying, ‘This is not done mindfully.’ Because of this, such bodhisattvas should strive to listen without parting from their spiritual guide and should stop looking for faults.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དེ་སྦྱིན་པའི་གཏམ་སྟོན་པ་ཐོས་ན་ནི་དེ་ས་དང་པོ་པར་བལྟའོ། །
en: “If bodhisattvas hear the Tathāgata giving a discourse on generosity, consider them to be on the first bhūmi.

source: ཚུལ་ཁྲིམས་ཀྱི་གཏམ་གྱིས་ནི་ས་གཉིས་པར་རོ། །
en: If the discourse is on discipline, consider them to be on the second bhūmi.

source: བཟོད་པའི་གཏམ་གྱིས་ནི་ས་གསུམ་པར་རོ། །
en: If the discourse is on patience, consider them to be on the third bhūmi.

source: བརྩོན་འགྲུས་ཀྱི་གཏམ་གྱིས་ནི་ས་བཞི་པར་རོ། །
en: If the discourse is on diligence, consider them to be on the fourth bhūmi.

source: བསམ་གཏན་གྱི་གཏམ་གྱིས་ནི་ས་ལྔ་པར་རོ། །
en: If the discourse is on meditation, consider them to be on the fifth bhūmi.

source: ཤེས་རབ་ཀྱི་གཏམ་གྱིས་ནི་ས་དྲུག་པར་རོ། །
en: If the discourse is on insight, consider them to be on the sixth bhūmi.

source: སྙིང་རྗེ་ཆེན་པོའི་གཏམ་གྱིས་ནི་ས་བདུན་པར་རོ། །
en: If the discourse is on great compassion, consider them to be on the seventh bhūmi.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་གཏམ་གྱིས་ནི་ས་བརྒྱད་པར་རོ། །
en: If the discourse is on the discernments, consider them to be on the eighth bhūmi.

source: ཏིང་ངེ་འཛིན་གྱི་གཏམ་གྱིས་ནི་ས་དགུ་པར་རོ། །
en: If the discourse is on samādhi, consider them to be on the ninth bhūmi.

source: སྟོབས་ཡོངས་སུ་རྫོགས་པའི་གཏམ་གྱིས་ནི་ས་བཅུ་པར་རོ། །
en: If the discourse is on the perfected powers, consider them to be on the tenth bhūmi. 9.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་གཤེགས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པ་ལ་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata miraculously flying through the sky, recognize that their awakening is predicted on the seventh bhūmi.

source: དེས་ནི་ནང་དུ་ཡང་དག་འཇོག་ལ་གདུ་བར་བྱ་ཞིང་ཆོས་ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་པར་ཡང་བྱའོ། །
en: Such bodhisattvas should collect themselves in meditative seclusion and acquire acceptance of the profound Dharma.

source: དེས་ན་དེ་མྱུར་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར་རོ། །
en: By doing so, they will swiftly reach completely perfect awakening.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་ལ་བཞུགས་པར་མཐོང་ན་ནི་ས་དང་པོར་རོ། །
en: “If bodhisattvas see the Tathāgata sitting in the sky, they are on the first bhūmi.

source: གཤེགས་པས་ནི་ས་གཉིས་པར་རོ། །
en: If the Tathāgata is moving about, the bodhisattvas are on the second bhūmi.

source: ས་ལ་བཞུགས་ཤིང་འོད་རབ་ཏུ་འགྱེད་པས་ནི་ས་གསུམ་པར་རོ། །
en: If the Tathāgata is standing on the earth emanating brilliant light, the bodhisattvas are on the third bhūmi.

source: བཞུགས་ཤིང་ཆོས་སྟོན་པས་ནི་ས་བཞི་པར་རོ། །
en: If the Tathāgata is standing while teaching Dharma, the bodhisattvas are on the fourth bhūmi.

source: ཆོ་འཕྲུལ་མཛད་པས་ནི་ས་ལྔ་པར་རོ། །
en: If the Tathāgata is performing miracles, the bodhisattvas are on the fifth bhūmi.

source: ས་ལ་བཞུགས་ཤིང་སྙོམས་པར་ཞུགས་པས་ནི་ས་དྲུག་པར་རོ། །
en: If the Tathāgata is on the ground resting in meditation, the bodhisattvas are on the sixth bhūmi.

source: ས་ལ་བཞུགས་ཤིང་འོད་གྱེན་དུ་གཏོང་བས་ནི་ས་བདུན་པར་རོ། །
en: If the Tathāgata is on the ground casting brilliant light upward, the bodhisattvas are on the seventh bhūmi.

source: བཞེངས་ཤིང་ནམ་མཁའ་ལ་གཤེགས་པ་དང་མི་སྣང་བར་མཛད་པས་ནི་ས་བརྒྱད་པ་ལ་གནས་པར་འགྱུར་རོ། །
en: If the Tathāgata rises up, moves through the sky, and renders himself invisible, the bodhisattvas are on the eighth bhūmi. 10.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མཐོང་ན། དེས་ནི་དམ་པའི་ཆོས་སྤངས་པ་དང་། རབ་ཏུ་བྱུང་ནས་ཀྱང་ཚུལ་འཆོས་པ་དང་། བརྫུན་གྱིས་རྙེད་པ་ཡོངས་སུ་བཙལ་བ་ཡིན་པས་དེས་དཀོན་མཆོག་གསུམ་ལ་བསྙེན་བཀུར་བྱ་བ་ལ་བརྩོན་པར་བྱ་ཞིང་ཆོས་སྨྲ་བ་རྣམས་ལ་ཡང་གོས་ཀྱི་སྦྱིན་པ་བྱ། སྒོ་གསུམ་ཡང་ཤིན་ཏུ་བསྡམ་པར་བྱའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata passing into parinirvāṇa, they have abandoned the sacred Dharma and, even after renouncing, acted hypocritically and sought gain through dishonesty. This being the case, such bodhisattvas should strive to venerate the Three Jewels, offer clothing to Dharma teachers, and keep their three doors restrained.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། །
en: By doing so, those bodhisattvas’ related karmic obscurations will be purified.

source: དེས་ནི་ས་དང་པོ་ལྔ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: Consider them to be on one of the first five bhūmis.

source: རྡོ་རྗེས་རབ་འཛོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཞུགས་ལ་བཞེན་པ་མཐོང་ན། དེས་ནི་སྡིག་པའི་གྲོགས་པོའི་དབང་གིས་དམ་པའི་ཆོས་ནུབ་པ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱས་པ་ཡིན་ཏེ།
en: 11. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata being cremated, it is a sign that they have rejoiced in the decline of the Dharma under the influence of an evil companion.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: Consider those bodhisattvas to be on the first bhūmi.

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་རིང་པོ་མ་ལོན་པ་ཞིག་ཡིན་ན་ནི་ལས་དང་པོ་པར་བལྟ་སྟེ།
en: If they have only recently given rise to the mind set on awakening, consider them to be novices.

source: དེས་ཞག་བདུན་དུ་ཆོས་སྨྲ་བ་འམ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱི་སྤྱན་སྔར་མཚན་ཐོག་ཐག་ཏུ་མར་མེ་བཟུང་བར་བྱ་ཞིང་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་སྡིག་པ་ཡང་བཤགས་པར་བྱ། སེམས་ཅན་རྣམས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་ཡང་བྱ་སྟེ།
en: Such bodhisattvas should recite the Dharma for a week, hold a lamp in front of a caitya of a tathāgata for an entire night, confess their evil actions three times a day and three times a night, and encourage beings to accept the sublime Dharma.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དག་རྙེད་ན་དེ་ནི་ས་གསུམ་པར་བལྟ་སྟེ།
en: 12. “Vajrapramardin, if in a dream bodhisattvas find the Tathāgata’s physical relics, consider them to be on the third bhūmi.

source: ཚེ་རྗེས་ན་ཡང་སངས་རྒྱས་དང་ཕྲད་པར་འགྱུར་ཞིང་ལུང་བསྟན་པ་ཡང་ཐོབ་པར་འགྱུར། ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: It is also a sign that those bodhisattvas will encounter a buddha in their next life, receive a prediction, and master the perfections.

source: ས་གཞན་ལ་གནས་པ་ཞིག་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དག་རྙེད་ན་དེའི་མཚན་མ་ནི་འདི་དག་ཡིན་ཏེ།
en: “If bodhisattvas residing on other bhūmis find the Tathāgata’s physical relics in a dream it is a sign in the following ways.

source: གང་གིས་དབུ་སྐྲ་དག་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: Consider bodhisattvas who find hair from the Tathāgata’s head to be on the first bhūmi.

source: སེན་མོས་ནི་ས་གཉིས་པར་རོ། །རིང་བསྲེལ་གྱིས་ནི་ས་གསུམ་པར་རོ། །ཚེམས་ཀྱིས་ནི་ས་བཞི་པར་རོ། །མཆེ་བས་ནི་ས་ལྔ་པར་རོ། །མཛོད་སྤུས་ནི་ས་དྲུག་པར་རོ། །ཕྱག་གིས་ནི་ས་བདུན་པར་རོ། །གཙུག་ཏོར་གྱིས་ནི་ས་བརྒྱད་པར་རོ། །སྐུ་སོ་སོར་ཕྱེ་བས་ནི་ས་དགུ་པར་རོ། །སྐུ་རིལ་པོས་ནི་ས་བཅུ་པར་རོ། །
en: Fingernails indicate the second bhūmi, small particles indicate the third bhūmi, a tooth indicates the fourth bhūmi, a canine tooth indicates the fifth bhūmi, an ūrṇā indicates the sixth bhūmi, a hand indicates the seventh bhūmi, an uṣṇīṣa indicates the eighth bhūmi, individual parts of the body indicate the ninth bhūmi, and his entire body indicates the tenth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་དབུ་སྐྲ་འཐོར་བ་དག་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟ་སྟེ།
en: 13. “Vajrapramardin, if in a dream bodhisattvas find scattered strands of hair from the Tathāgata’s head, consider those bodhisattvas to be on the ninth bhūmi.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡིན་ལ། དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་ཚེ་རྗེས་པས་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: It is an indication that previous thus-gone, worthy, completely perfect buddhas had predicted the bodhisattvas’ awakening, and that all their karmic obscurations will be purified in their next life.

source: གལ་ཏེ་ཁྱིམ་པའི་ཚུལ་དུ་གནས་པ་ཞིག་གིས་དབུ་སྐྲ་དག་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If bodhisattvas who live as householders find strands of hair, consider them to be on the first bhūmi.

source: གལ་ཏེ་ཁྱིམ་ནས་ངེས་པར་བྱུང་བ་ཞིག་གིས་རྙེད་ན་ས་གཉིས་པར་བལྟའོ། །
en: If those who have renounced householder life find them, consider them to be on the second bhūmi.

source: སྲང་དུ་སོང་བ་ཞིག་གིས་རྙེད་ན་ས་གསུམ་པར་བལྟའོ། །
en: If bodhisattvas walking in the road find them, consider them to be on the third bhūmi.

source: གལ་ཏེ་སུམ་མདོར་རྙེད་ན་ས་བཞི་པར་བལྟའོ། །
en: If found at a crossroads, consider those bodhisattvas to be on the fourth bhūmi.

source: གྲོང་ཁྱེར་གྱི་སྒོར་རྙེད་ན་ས་ལྔ་པར་བལྟའོ། །
en: If found at the gates of a city, consider those bodhisattvas to be on the fifth bhūmi.

source: ཕྱིར་བྱུང་བས་རྙེད་ན་ས་དྲུག་པར་བལྟའོ། །
en: If bodhisattvas find them when exiting, consider them to be on the sixth bhūmi.

source: སྐྱེད་མོས་ཚལ་ན་འདུག་པས་རྙེད་ནས་བདུན་པར་བལྟའོ། །
en: If the hairs are found in a garden, consider those bodhisattvas to be on the seventh bhūmi.

source: སྐྱེ་བོའི་ནང་ན་འདུག་པས་རྙེད་ན་ས་བརྒྱད་པར་བལྟའོ། །
en: If the hairs are found among people, consider those bodhisattvas to be on the eighth bhūmi.

source: ནམ་མཁའ་ལས་རྙེད་ན་ས་དགུ་པར་བལྟའོ། །
en: If they are found in the sky, consider those bodhisattvas to be on the ninth bhūmi.

source: སྙོམས་པར་ཞུགས་པས་རྙེད་ན་ས་བཅུ་པར་བལྟའོ། །
en: If they are found while meditating, consider those bodhisattvas to be on the tenth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་མཆོད་རྟེན་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ཞིང་དེ་ལ་བདུད་ཀྱི་ལས་ཀྱང་ཆུང་བར་རིག་པར་བྱ་སྟེ།
en: 14. “Vajrapramardin, if in a dream bodhisattvas see caityas that they have never seen before, you should recognize that those bodhisattvas have few karmic obscurations and that the activity of Māra affects them only slightly.

source: གལ་ཏེ་དེ་དགེ་བའི་བཤེས་གཉེན་དག་ལ་སྟེན་པར་བྱེད་ན་ཆོས་ཀྱི་བཟོད་པ་ཡང་རྟོགས་པར་འགྱུར་ཞིང་གཟུངས་ཀྱང་ཐོབ་པར་འགྱུར་ཏེ།
en: If those bodhisattvas rely on a spiritual guide, they will gain acceptance about phenomena and will also obtain the power of dhāraṇī.

source: དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་ཤེས་པར་བྱའོ། །
en: You should understand that such bodhisattvas can be on any of the ten bhūmis.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་འཇིམ་པ་ལས་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they see a caitya of the Tathāgata made out of clay, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་རྡོ་ལས་བྱས་པ་མཐོང་ན་ས་གཉིས་པར་བལྟའོ། །
en: If they see one made out of stone, consider them to be on the second bhūmi.

source: གལ་ཏེ་རྡོ་ཐལ་གྱིས་བྱི་དོར་བྱས་པ་མཐོང་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they see one made out of mortar, consider them to be on the third bhūmi.

source: གལ་ཏེ་སྟེགས་བུ་དང་གདུགས་བྱི་དོར་བྱས་པ་མཐོང་ན་ས་བཞི་པར་བལྟའོ། །
en: If they see one with a clean plinth and parasol, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་རྡོའི་ཀ་བ་བྱི་དོར་བྱས་པ་མཐོང་ན་ས་ལྔ་པར་བལྟའོ། །
en: If they see one with clean stone pillars, consider them to be on the fifth bhūmi.

source: གལ་ཏེ་གསེར་གྱིས་སྦྲེལ་བ་མཐོང་ན་ས་དྲུག་པར་བལྟའོ། །
en: If they see one laminated with gold, consider them to be on the sixth bhūmi.

source: གལ་ཏེ་རིན་པོ་ཆེའི་དྲ་བས་ཀུན་ཏུ་གཡོགས་པ་མཐོང་ན་ས་བདུན་པར་བལྟའོ། །
en: If they see one covered with a jeweled filigree, consider them to be on the seventh bhūmi.

source: གལ་ཏེ་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་ཀུན་ནས་གཡོགས་པ་མཐོང་ན་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see one covered with a lattice of small bells, consider them to be on the eighth bhūmi.

source: ས་དང་པོ་བདུན་པོ་དག་ལ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རིག་པར་བྱའོ། །
en: Know that the signs seen on the first to seventh bhūmis may also be the activity of Māra.

source: ས་དགུ་པ་དང་། ས་བཅུ་པ་དག་ལ་ནི་རྨི་ལམ་ལོག་པར་མཐོང་བ་མེད་དོ། །
en: Ninth- and tenth-bhūmi bodhisattvas do not have mistaken dream visions. 15.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རིན་པོ་ཆེས་བརྒྱན་པ་དག་མཐོང་ན། དེ་ནི་རིང་པོར་མི་ཐོགས་པར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར་ཞིང་དེ་ལ་ལྷ་རྣམས་ཀྱང་སེམས་པར་འགྱུར་ཏེ།
en: “Vajrapramardin, if in a dream bodhisattvas see caityas of the Tathāgata that are adorned with jewels, before long those bodhisattvas will reach completely perfect awakening and captivate the minds of the gods.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་རིག་པར་བྱའོ། །
en: You should consider such bodhisattvas to be on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཆོ་འཕྲུལ་མཛད་པ་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཚེ་འདི་ཉིད་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་འགྱུར་ཏེ། །
en: 16. “Vajrapramardin, if in a dream bodhisattvas see caityas of the Tathāgata that perform miracles, it indicates that those bodhisattvas have purified all karmic obscurations in this life.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་བསམས་པ་ཡིན་ནོ། །
en: Consider such bodhisattvas to be on the eighth bhūmi. Bodhisattvas too will think of them.

source: དེས་སྡིག་པའི་གྲོགས་པོ་དག་ཡོངས་སུ་སྤང་བར་བྱ་ཞིང་ས་དང་པོ་ལ་དད་པར་བྱ།
en: “On the first bhūmi, they should shun evil companions and cultivate faith.

source: ས་གཉིས་པ་ལ་ཡེ་ཤེས་ཡོངས་སུ་བཙལ།
en: On the second bhūmi, they should seek out wisdom.

source: ས་གསུམ་པ་ལ་མོས་པ་མང་དུ་བྱ།
en: On the third bhūmi, they should increase their conviction.

source: ས་བཞི་པ་ལ་སེམས་དག་པར་བྱ།
en: On the fourth bhūmi, they should purify their mind.

source: ས་ལྔ་པ་ལ་དད་པས་མོས་པར་བྱ།
en: On the fifth bhūmi, they should use faith to experience conviction.

source: ས་དྲུག་པ་ལ་སེམས་མཉམ་པར་བྱ།
en: On the sixth bhūmi, they should cultivate even-mindedness.

source: ས་བདུན་པ་ལ་དོན་དམ་པ་ལ་མོས་པར་བྱ།
en: On the seventh bhūmi, they should feel conviction in the ultimate.

source: ས་བརྒྱད་པ་ལ་བཀོད་པ་དག་ལ་མོས་པར་བྱ།
en: On the eighth bhūmi, they should feel conviction in the displays.

source: ས་དགུ་པ་ལ་ནི་བྱིན་གྱིས་བརླབས་པར་བྱའོ། །
en: On the ninth bhūmi, they should experience confirmation.
